Revit 2027 API
AnalyticalBusData.CurrentRating Property
 The current rating value of the analytical bus.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CurrentRating { get; set; }
Public Property CurrentRating As Double
	Get
	Set
public:
property double CurrentRating {
	double get ();
	void set (double value);
}
member CurrentRating : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for rating is not a number -or- When setting this property: The given value for rating is not finite
ArgumentOutOfRangeException |  When setting this property: The given value for rating must be non-negative.
See Also
Reference
AnalyticalBusData Class
Autodesk.Revit.DB.Electrical Namespace